{
  "Tab信息切换展示": "Tab information switching display",
  "Tab组件使用样例": "Tab component usage example",
  "banner模板": "Banner template",
  "footer模板": "Footer template",
  "产品特性信息": "Product feature information",
  "作品展示": "Gallery",
  "使用远程API获取表格数据，并进行后台分页": "Use remote API to get table data and perform background paging",
  "公告模板": "Announcement template",
  "当前用户在固定的用户列表内就正常访问，没在的话跳转到无权限页面。可在页面生命周期函数中配置该函数进行权限控制。": "The current user can access normally in the fixed user list. If not, it will jump to the page without permission. \nThis function can be configured in the page life cycle function for permission control.",
  "想更灵活使用后台转发接口的能力，可以使用本函数。调用转发函数的参数如函数内容所示，可以结合变量来动态改变参数。在 then 回调用处理业务逻辑。": "If you want to use the ability of the background forwarding interface more flexibly, you can use this function. \nThe parameters of calling the forwarding function are as shown in the function content, and the parameters can be dynamically changed by combining variables. \nBusiness logic is handled in the then callback.",
  "拓扑树使用样例": "Example of topology tree usage",
  "无分页表格模板": "No pagination table template",
  "无权限提示页面": "Prompt page without permission",
  "显示Dialog弹窗": "Show dialog popup",
  "显示侧滑弹层": "Show side-slip popup",
  "查询表格": "Inquiry form",
  "步骤使用样例": "Step by step example",
  "用于清空表单容器组件中每一个输入组件的值": "Used to clear the value of each input component in the form container component.",
  "由于部分接口限制（比如跨域），纯前端无法调用该接口。需要通过后端转发接口来获取数据，就可以使用本方法。配置方法：Api Url 上配置接口地址，函数插槽编写业务处理，远程参数配置上编写业务处理回调参数": "Due to some interface restrictions (such as Cross-Domain), the pure front-end cannot call this interface. \nYou can use this method if you need to obtain data through the backend forwarding interface. \nConfiguration method: configure the interface address on the Api Url, write business processing in the function slot, and write business processing callback parameters in the remote parameter configuration.",
  "自定义横向导航模板": "Custom horizontal navigation template",
  "获取当前登录的用户名": "Get the currently logged in username",
  "表单容器使用样例": "Form container usage example",
  "表单容器组件的表单生成器": "Form builder for the form container component",
  "表单校验及提交数据至远程API": "Form validation and submit data to remote API",
  "表格排序和过滤模板": "Table sorting and filtering templates",
  "表格本地分页模板": "Table local pagination template",
  "表格模板": "Form template",
  "表格自定义展示列": "Table custom display column",
  "表格自定义操作列": "Table custom action column",
  "退出登陆，并跳转到登陆页面": "Log out and jump to the login page",
  "选项卡使用样例": "Tab usage example",
  "通过前端获取远程接口数据示例。可以替换代码中的接口地址来调用其它接口，在回调中进行业务处理": "Fetch remote interface data example via frontend. \nYou can replace the interface address in the code to call other interfaces, and perform business processing in the callback.",
  "通过远程函数动态设置表格的表头内容": "Dynamically set the header content of the table through a remote function",
  "如果需要对页面中的表单容器进行校验，可以使用本函数。注意：函数中的 dynamicForm 需要替换成表单容器组件 ref 属性的值，页面中每个 form 的 ref 值需要唯一。": "If you need to validate the form container in the page, you can use this function. \nNote: dynamicForm in the function needs to be replaced with the value of the ref attribute of the form container component, and the ref value of each form in the page needs to be unique.",
  "H5宣传页模板": "H5 publicity page template"
}
