{
  "应用: 新建应用区分vue2跟vue3, 支持拖拽vue3应用": "APP: supports vue3 APP.",
  "应用: 应用内菜单导航布局更新": "APP: update the navigation inside APP.",
  "应用: 表单统一修改成上下布局": "APP: form is uniformly modified to a vertical layout.",
  "画布: 画布ui重构、物料区、菜单栏、配置区更新": "Canvas: canvas ui refactoring, material area, menu bar, configuration area update.",
  "画布: 增加“撤销”快捷键": "Canvas: add 'undo' shortcut key.",
  "画布: v-model支持表达式": "Canvas: v-model input support enter expression.",
  "数据源: 数据源内置接口支持自定义字段": "Data source: data source built-in interface supports custom field.",
  "流程&表单: 表单字段数据源支持数据表、API数据源": "Flow & form: form field data sources support data tables and API data sources.",
  "应用: 国际化相关样式优化、问题修复": "APP: internationalization-related style optimization and bug fixes.",
  "画布: 进入画布时，数据未更新问题": "Canvas: the data is not updated when entering the canvas page.",
  "画布: 修复复制拥有相同type类型组件时，数据异常问题": "Canvas: fix the problem of abnormal data when copying components with the same type.",
  "画布: 修复自由布局的粘贴位置问题": "Canvas: fix the paste position problem of free layout.",
  "画布: 修复移动端漂浮栏滚动位置错误问题": "Canvas: fix the problem that the scrolling position of the floating bar on the mobile terminal is wrong.",
  "流程&表单: 流程相关问题修复": "Flow & form: fix related bug of flow.",
  "应用: 应用列表页增加应用模版推荐": "APP: add APP template recommendations to the APP list page.",
  "应用: 创建应用跟页面时，从空白创建跟从模板创建入口合并": "APP: Merge the entry for creating from empty and from templates when creating APP or page.",
  "画布: 增加AI开发助手": "Canvas: add AI development assistant.",
  "画布: 移动端新增时间选择、选择器组件": "Canvas: add time-picker and selector components in the mobile page.",
  "画布: 导航支持设置可拖拽区域": "Canvas: navigation menu add custom area.",
  "画布: 导航路由参数支持应用级变量": "Canvas: support APP-level variables for navigation routing parameters.",
  "画布: 离开画布时，如果未修改则不弹出离开确认弹窗": "Canvas: do not pop up the confirmation dialog when leaving the canvas if there are no unsaved changes.",
  "画布: 公开自定义组件按分类展示、区分移动端跟PC端自定义组件": "Canvas: display custom components by category and differentiate between mobile and PC custom components.",
  "函数&API: 请求支持设置header，header支持设置变量": "Func & API: request support for setting headers, and allow variables to be set in headers.",
  "函数&API: 请求配置参数时支持配置参数校验": "Func & API: support parameter validation for request configuration parameters.",
  "应用: 保存变量时，校验变量格式并错误提示": "APP: when saving variables, validate the variable format and display error messages if necessary.",
  "流程&表单: 表单字段数据源支持数据表相关问题修复": "Flow & form: fix issues related to data table in form field data source.",
  "流程&表单: 流程体验问题修复": "Flow & form: fix issues releated to flow experience.",
  "画布: 移动端导航使用问题优化": "Canvas: fix issues releated to navigation of the mobile page.",
  "画布: 修复v-vtml预览跟部署后变现不一致问题": "Canvas: fix the inconsistency of v-vtml between preview and relessed.",
  "函数&API: API使用提示优化": "Func & API: optimize API usage prompts.",
  "text, img 标签使用原生html标签，优化原生标签的 class 添加": "Text, img tags use native html tags, optimize the class add of native tags.",
  "优化": "Improved",
  "体验 bug 修复以及优化": "Experience bug fixes and optimizations.",
  "修复": "Fixed",
  "修复其他 bug": "Fix other bugs.",
  "应用: 支持国际化": "APP: support internationalization.",
  "应用: 抽屉Sideslider统一修改为可快捷关闭，关闭前有表单信息修改时二次弹窗提醒": "APP: sideslider is modified so that it can be closed quickly, and a second pop-up window reminds when there is a form information modification before closing.",
  "应用: 导航布局管理优化 & 优化移动端路由结构": "APP: optimization of navigation layout management.",
  "流程&表单: 提单页独立路由，节点保存逻辑拆分与修改": "Flow & form: lading page become Independent, splitting and modificating the save logic of node.",
  "画布: 修复vant-ui v-model绑定的源码问题": "Canvas: fix the source code problem of vant-ui v-model binding.",
  "流程&表单: 节点引用和复用表单字段key重复的问题处理": "Flow & form: node reference and reuse form field key duplicate problem handling.",
  "流程&表单: 删除提单页后复用表单报错问题修复": "Flow & form: fix the problem of error reporting in the reuse form after deleting the bill of lading page.",
  "应用: 路由管理支持预览对应导航布局": "APP: routing management supports previewing the corresponding navigation layout.",
  "数据源: 数据导入支持更新和去重": "Data source: data import supports updating and deduplication.",
  "流程&表单: 表单画布新增自动编号组件": "Flow & form: added automatic numbering component to Form Canvas.",
  "流程&表单: 表单画布新增计算组件": "Flow & form: added calculation component to the form canvas.",
  "画布: 移动端新增日期选择器组件": "Canvas: added date picker component on mobile.",
  "应用: 修复应用预览缓存问题": "APP: fix APP preview cache issue.",
  "修复刷新页面时，没有选中组件但右侧面板会显示 grid 属性的问题": "Fix the problem that when the page is refreshed, no component is selected but the grid property will be displayed on the right panel.",
  "修复预览页面高度截断 bug": "Fix preview page height truncation bug.",
  "其他: cookie path 设置": "Miscellaneous: cookie path setting.",
  "其他: 体验问题修复": "Others: experience bug fixes.",
  "其他: 修改身份认证失败状态码": "Others: modify the identity authentication failure status code.",
  "其他: 其他体验 bug 修复以及优化": "Others: other experience bug fixes and optimizations.",
  "其他: 复合组件更新": "Miscellaneous: composite component update.",
  "其他: 新增开放 API，新增获取发布部署相关信息接口": "Others: added an open API, and added an interface for obtaining release and deployment related information.",
  "其他: 更新 postcss 配置": "Miscellaneous: update postcss configuration.",
  "其他优化: 优化帮助入口；画布中鼠标改为手型；优化左侧栏收起的样式；部署页面优化；导航 logo 设置鼠标样式为 pointer，可点击跳转等等": "Other optimizations: optimize the help entry; change the mouse in the canvas to a hand shape; optimize the collapsed style of the left sidebar; optimize the deployment page; set the mouse style of the navigation logo to pointer, which can be clicked to jump, etc.",
  "其它: 版本更新日志交互优化": "Others: version update log interaction optimization.",
  "函数: 保存函数时自动修复Eslint格式问题": "Functions: automatically fix Eslint formatting issues when saving functions.",
  "函数: 函数市场支持导入导出函数": "Function: the function market supports importing and exporting functions.",
  "函数: 函数执行参数交互优化及支持事件类型参数": "Function: interactive optimization of function execution parameters and support for event type parameters.",
  "函数: 支持函数在线调试": "Function: support function online debugging.",
  "函数: 远程函数API选择 及 API节点里API地址选择交互优化": "Function: interactive optimization of remote function API selection and API address selection in API nodes.",
  "函数编辑新增 eslint 检测，代码提示等等": "Function editing adds eslint detection, code hints, etc.",
  "运维开发平台（LessCode）初始版本": "LessCode Initial Version.",
  "右侧组件属性、样式、事件说明": "Component properties, styles, and event descriptions on the right.",
  "增加复制、粘贴、撤销、恢复、删除等快捷操作": "Add shortcut operations such as copy, paste, undo, restore, delete, etc.",
  "增加清空 grid 操作": "Add empty grid operation.",
  "平台: 统一优化平台文本溢出展示及交互": "Platform: unified optimization platform text overflow display and interaction.",
  "平台：统一优化表格无数据时展示、搜索相关场景交互": "Platform: unified optimization table display when there is no data, search related scene interaction.",
  "应用: API管理支持生成对应远程函数": "APP: API management supports generating corresponding remote functions.",
  "应用: fix编辑路由数据为空问题": "APP: fix edit routing data is empty problem.",
  "应用: 修复从模板新建应用时，模板预览图没有使用模板封面": "APP: fix when creating a new APP from a template, the template preview does not use the template cover.",
  "应用: 修复创建应用时，底部footer遮挡确认按钮问题": "APP: fix the problem that the bottom footer blocks the confirmation button when creating an APP.",
  "应用: 修复删除页面时报错问题": "APP: fix the error problem when deleting a page.",
  "应用: 修复复制项目时，未复制表信息问题": "APP: fix the problem that table information is not copied when copying items.",
  "应用: 修复应用、页面、函数分类、自定义组件分类名称校验重名时不区分大小写问题": "APP: fix case-insensitive problem when verifying duplicate names of APP, page, function category, and custom component category names.",
  "应用: 修复数据源建表新增字段报错问题": "APP: fix the error reporting of new fields in the table created by the data source.",
  "应用: 修复新建版本在变量引用变量时关联数据的问题": "APP: fix the problem of associating data when the variable refers to the variable in the new version.",
  "应用: 修复没有PC根路径时根路由无法绑定移动端路由的问题及根路由支持解除绑定": "APP: fix the problem that the root routing cannot be bound to the mobile terminal routing when there is no PC root path, and the root routing supports unbinding.",
  "应用: 修复页面更新时间不正确问题": "APP: fix the problem that the page update time is incorrect.",
  "应用: 修复页面模板管理中操作模板后，左侧模板分类数据未及时更新问题": "APP: fix the problem that after operating the template in the page template management, the template category data on the left is not updated in time",
  "应用: 其它交互及样式问题修复和文案调整": "APP: other interaction and style bug fixes and copy tweaks.",
  "应用: 凭证token改成自动获取, 去掉凭证管理页面": "APP: the certificate token is changed to automatic acquisition, and the certificate management page is removed.",
  "应用: 函数编辑时，切换函数交互优化": "APP: when editing functions, switch function interaction optimization.",
  "应用: 函数调试体验问题优化": "APP: function debugging experience problem optimization.",
  "应用: 创建LessCode应用时同步创建并绑定开发PaaS平台 - 开发者中心应用，绑定后可直接将拖拽成功的应用发布部署至PaaS平台 - 开发者中心": "APP: synchronously create and bind the development PaaS Developer Center APP when creating LessCode APP. After binding, you can directly drag and drop the successful APP publishing deployment to the PaaS Developer Center.",
  "应用: 增加LessCode首页": "APP: add LessCode home page.",
  "应用: 增加函数市场模块，用户可将函数市场函数添加至应用使用": "APP: add function market module, users can add function market functions to APP.",
  "应用: 增加应用版本管理功能": "APP: add APP version management function.",
  "应用: 增加文件管理模块，可上传图片后在图片组件、轮播图组件，组件背景图片设置等地方引用；可上传压缩包、文档等类型文件后，在文字链接组件中引用": "APP: add a file management module, which can be uploaded and referenced in the image component, swiper component, component background image setting, etc. after uploading files such as compressed packages and documents, and referenced in the text link component.",
  "应用: 增加流程管理，可创建包含流程的页面及其相应数据管理页": "APP: add flow management, you can create pages containing flow and their corresponding data management pages.",
  "应用: 增加表单类型页面，创建页面时会同步创建对应的数据表，也可以基于表单页面创建对应的表单管理页": "APP: add a form type page, and the corresponding data table will be created synchronously when the page is created, and the corresponding form management page can also be created based on the form page.",
  "应用: 导航滚动和应用收起样式优化": "APP: navigation scrolling and APP collapse style optimization.",
  "应用: 平台右侧悬浮按钮交互优化": "APP: interactive optimization of the floating button on the right side of the platform.",
  "应用: 平台对接权限中心": "APP: platform docking IAM.",
  "应用: 平台本身和拖拽应用的源码框架升级为bk  cli2": "APP: the platform itself and the source code framework of the drag-and-drop APP are upgraded to bk cli2.",
  "应用: 应用内左侧导航支持展开收起": "APP: the left navigation in the APP supports expand and collapse.",
  "应用: 应用列表支持排序": "APP: the APP list supports sorting.",
  "应用: 应用根路由支持绑定跳转到移动端路由": "APP: the APP root routing supports binding and jumping to the mobile terminal routing.",
  "应用: 应用管理和页面管理增加列表视图及卡片布局下卡片宽度自适应": "APP: APP management and page management add list view and card width adaptive under card layout.",
  "应用: 应用预览和页面预览速度优化": "APP: APP preview and page preview speed optimization.",
  "应用: 开源版交付时内置官方页面模板和函数市场函数": "APP: built-in official page templates and function market functions when the open source version is delivered.",
  "应用: 拖拽应用对接权限中心，支持对拖拽页面设置访问控制和自定义权限操作": "APP: the drag and drop APP is connected to the IAM, and supports setting access control and custom permission operations on the drag and drop page.",
  "应用: 支持移动端h5页面拖拽": "APP: support mobile H5 page drag and drop.",
  "应用: 数据源使用体验问题": "APP: problems with data source experience.",
  "应用: 数据源管理对接bkBase数据表，数据操作模块优化": "APP: data source management docking BK-Base data table, data operation module optimization.",
  "应用: 数据源管理模块：支持数据操作": "APP: data source management module: support data manipulation.",
  "应用: 数据表的id没有从1开始": "APP: the ID of the data table does not start from 1.",
  "应用: 文件管理支持导出功能": "APP: file management supports export function.",
  "应用: 文档页面按导航分类": "APP: documentation pages sorted by navigation.",
  "应用: 新增API管理模块": "APP: added API management module.",
  "应用: 新增应用模板，用户可在模板市场或新建应用时，基于官方模板直接创建应用": "APP: add APP templates, users can directly create APP based on official templates in the template market or when creating new APP.",
  "应用: 新增支持markdown类型页面": "APP: added support for markdown type pages.",
  "应用: 新建页面调整，新建页面调整成先选择页面类型，再选择来源（空白页面或模板）": "APP: new page adjustment, new page adjustment to select the page type first, and then select the source (blank page or template).",
  "应用: 流程提单页展示预览图": "APP: flow bill of lading page display preview.",
  "应用: 浏览器宽度太小时，导航样式错乱问题": "APP: the browser width is too small, and the navigation style is messed up.",
  "应用: 菜单归类划分调整": "APP: menu category and division adjustment.",
  "应用: 运营数据：函数所属应用信息缺失": "APP: operation data: the APP information of the function is missing.",
  "应用: 远程函数使用优化，可直接选择apigateway网关api": "APP: remote function usage optimization, you can directly select the API FROM API Gateway.",
  "应用: 部署版本调整优化": "APP: deployment version adjustment and optimization.",
  "应用: 项目概念更换为应用": "APP: project concept replaced by APP.",
  "应用管理 / 画布: 函数支持自己调用自己": "APP management / Canvas: functions support calling themselves.",
  "应用管理: 为初次进入系统的用户创建 demo 应用时，数据添加 createUser 和 updateUser": "APP management: when creating demo APP for users who enter the system for the first time, add createUser and updateUser to the data.",
  "应用管理: 为初次进入系统的用户新增了 demo 应用": "APP management: added a demo APP for users who enter the system for the first time.",
  "应用管理: 优化没有权限调用 apigateway 接口的提示信息": "APP management: optimize the prompt information for not having permission to call the apigateway interface.",
  "应用管理: 优化页面截图实现": "APP management: optimize page screenshots.",
  "应用管理: 修复共享的应用组件公开范围中特定应用丢失的问题": "APP management: fixed missing specific APP in Shared APP component visibility.",
  "应用管理: 修复切换应用当前应用数据未更新问题": "APP management: fix the problem that the current APP data is not updated when switching APP.",
  "应用管理: 函数和计算变量添加自动fix eslint": "APP management: functions and computed variables add automatic fix eslint.",
  "应用管理: 函数模块，远程函数支持调用 APIGW API（需先绑定蓝鲸应用模块）": "APP management: function module, remote function supports calling APIGW API (the BlueKing APP module needs to be bound first).",
  "应用管理: 函数相关体验问题": "APP management: function-related experience issues.",
  "应用管理: 创建应用时新建默认 home 页面和代码查看器样式优化": "APP management: create a new default home page and code viewer style optimization when creating an APP.",
  "应用管理: 删除权限增加是否为数据的创造者的判断逻辑": "APP management: the logic of judging whether the increase of delete permission is the creator of the data.",
  "应用管理: 发布部署，绑定蓝鲸应用模块时，列表包含已下架的应用": "APP management: When publishing and deploying, when binding the BlueKing APP module, the list contains archived APP.",
  "应用管理: 变量管理": "APP management: variable management.",
  "应用管理: 复制应用时不创建默认 home 页面": "APP management: don't create a default home page when copying an APP.",
  "应用管理: 导航支持配置 query": "APP management: navigation support configuration query.",
  "应用管理: 导航路由参数 tips 优化": "APP management: navigation routing parameter tips optimization.",
  "应用管理: 布局模板实例新增[** 复合型导航布局 **](/help/layout)，方便用户更快速的搭建页面": "APP management: added [** Composite Navigation Layout **](/help/layout) to the layout template instance, which is convenient for users to build pages more quickly.",
  "应用管理: 支持函数的导入导出": "APP management: support function import and export.",
  "应用管理: 新增布局模板实例模块，用来设置页面的导航布局，方便用户更快速的搭建页面": "APP management: added a new layout template instance module, which is used to set the navigation layout of the page, so that users can build pages more quickly.",
  "应用管理: 新增成员管理模块，用来管理应用的成员以及权限": "APP management: add a member management module to manage APP members and permissions.",
  "应用管理: 新增操作审计功能": "APP management: added operation audit function.",
  "应用管理: 自定义组件支持设置公开范围，可公开到特定应用以及所有应用（包括后续新增的应用)": "APP management: custom components support setting the exposure range, which can be exposed to specific APP and all APP (including subsequent added APP).",
  "应用管理: 自定义组件文档增加本地调试指引": "APP management: custom component documentation adds local debugging guidelines.",
  "应用管理: 页面绑定路由时未禁用已绑定跳转的路由问题": "APP management: the routing problem of the bound jump is not disabled when the page is bound to the routing.",
  "应用管理: 页面预览图偶发失败的问题": "APP management: occasional failure of page preview.",
  "应用：优化应用列表和页面列表加载性能": "APP: optimize APP list and page list loading performance.",
  "应用：优化自定义组件文档提示": "APP: refine Custom Components Documentation Hints.",
  "应用：功能页面增加对应文档指引入口": "APP: the function page adds a corresponding document guide entry.",
  "应用：增加在线建表、数据源管理模块": "APP: add online table building, data source management module.",
  "应用：应用顶部导航更新": "APP: APP top navigation update.",
  "应用：支持应用导入导出功能": "APP: support APP import and export functions.",
  "应用：新增页面内容模板，用户可以在画布中将页面的局部或者整个内容区域保存为模板，并在新建页面时或者画布拖拽中直接使用": "APP: added page content templates, users can save a part or the entire content area of ​​the page as a template in the canvas, and use it directly when creating a new page or dragging and dropping on the canvas.",
  "应用：自定义组件分类支持单独修改": "APP: custom component category supports individual modification.",
  "应用：自定义组件管理支持导出功能": "APP: custom component management supports export function.",
  "应用：资源管理目录调整": "APP: resource management directory tuning.",
  "应用：页面内容模板支持导入导出": "APP: page content template supports import and export.",
  "拖拽画布中的函数管理优化": "Function management optimization in drag and drop canvas.",
  "拖拽部分 bug 修复": "Drag and drop some bug fixes.",
  "数据源: 数据操作模块体验优化": "Data source: data operation module experience optimization.",
  "数据源: 数据表支持导入sql和excel格式数据": "Data source: the data table supports importing data in sql and excel formats.",
  "文档: 增加应用模板使用指引和页面模板使用指引": "Documentation: add APP template usage guidelines and page template usage guidelines.",
  "文档：增加交互式组件使用文档、变量使用文档": "Documentation: add interactive component usage documentation and variable usage documentation.",
  "新增": "Add",
  "新增[表格查询案例文档](/help/case - table  search)": "Added [table query case document](/help/case - table search).",
  "新增【图表】类型组件，增加【折线图】、【柱状图】、【饼状图】示例": "Added [Chart] type component, and added examples of [Line Chart], [Bar Chart], and [Pie Chart].",
  "新增函数管理模块": "Add function management module.",
  "新增发布部署模块，与蓝鲸 PaaS 平台打通": "Added a release deployment module to connect with the BlueKing PaaS.",
  "新增应用管理模块": "Added APP management module.",
  "新增应用级别的源码下载，方便二次开发": "Added APP source code download to facilitate secondary development.",
  "新增应用级别路由配置功能": "Added APP routing configuration function.",
  "新增自定义组件下架逻辑": "Add custom component archiving logic.",
  "新增自定义组件管理模块": "Added custom component management module.",
  "新增部分基础组件": "Add some basic components.",
  "新增页面生命周期配置": "Added page life cycle configuration.",
  "新增页面管理模块": "New page management module.",
  "新增页面配置，支持简单的页面路由设置": "Added page configuration to support simple page routing settings.",
  "每个组件必要的属性增加 tip 说明": "The necessary attributes of each component add tip description.",
  "流程 & 表单：api节点增加调用调试功能": "Flow & form: add call debugging function to API node.",
  "流程 & 表单：下拉类表单组件【单选下拉、可输入单选下拉、多选下拉、单选框、多选框】支持默认选项联动": "Flow & form: drop-down form components [single-selection drop-down, inputable single-selection drop-down, multiple-selection drop-down, single-selection box, multi-selection box] support default option linkage.",
  "流程 & 表单：流程api节点变量使用交互优化": "Flow & form: flow api node variables use interaction optimization.",
  "流程 & 表单：流程、表单管理页 页面设置新增关联流程和关联表单信息": "Flow & form: flow, form management page page settings add associated flow and associated form information.",
  "流程 & 表单：流程类应用预览时增加跳转到itsm入口": "Flow & form: add a jump to itsm entry when previewing a flow APP.",
  "流程 & 表单：流程部署状态提示优化": "Flow & form: flow deployment status prompt optimization.",
  "流程 & 表单：表单和数据管理页支持页面生命周期函数绑定": "Flow & form: form and data management pages support page life cycle function binding.",
  "流程 & 表单：表单字段编辑支持复制、删除快捷键": "Flow & form: form field editing supports copy and delete shortcut keys.",
  "流程 & 表单：表单组件【单行文本 / 多行文本 / 数字 / 日期 / 时间】默认值支持联动": "Flow & form: form component [single-line text / multi-line text / number / date / time] default value supports linkage.",
  "流程&表单: 数据管理页支持添加操作按钮": "Flow & form: data management page supports adding action buttons.",
  "流程&表单: 新增评分组件": "Flow & form: add scoring component.",
  "流程&表单: 表单字段配置隐藏条件增加校验空表单逻辑": "Flow & form: form field configuration hidden condition adds check empty form logic.",
  "添加[帮助文档](/help)": "Add [help documentation](/help).",
  "由于slot相关逻辑重构改动较大，涉及存量数据更新，请用户先自行备份数据库page表数据，并在更新此版本后在浏览器执行调用 域名 / api / db - upgrade - helper /20210722_update_slot更新数据": "Due to the large changes in slot-related logical refactoring, which involves stock data updates, users are requested to back up the database page table data by themselves first, and after updating this version, Call Domain Name / API / DB - upgrade - helper /20210722_update_slot to update data in the browser.",
  "画布: Card组件开放foot、header插槽": "Canvas: card component opens foot and header slots.",
  "画布: Element 基础组件库组件丰富": "Canvas: Element base component library is rich in components.",
  "画布: Element按钮组件增加icon设置属性": "Canvas: add icon setting property to Element button component.",
  "画布: Element表单组件（标签输入、穿梭框、rate组件）加上v - model可以获取表单值": "Canvas: Element form components (label input, Transfer, rate component) plus v-model can get form values.",
  "画布: bkcharts图表配置项优化": "Canvas: BKcharts chart configuration item optimization.",
  "画布: block布局样式面板展示margin属性、段落组件样式面板展示position属性": "Canvas: the block layout style panel displays the margin attribute, and the paragraph component style panel displays the position attribute.",
  "画布: chart 图表类型支持动态设置数据和属性": "Canvas: chart chart type supports dynamic setting of data and properties.",
  "画布: dialog 组件交互优化。显示、隐藏按钮常驻，且再交互组件右侧配置面板添加可隐藏 / 显示的按钮；组件树点击非交互组件，当前交互式组件直接隐藏；遮罩层会添加隐藏组件的具体 id": "Canvas: dialog component interaction optimization. \nThe display and hide buttons are permanent, and a button that can be hidden/displayed is added to the configuration panel on the right side of the interactive component; the component tree clicks on the non-interactive component, and the current interactive component is directly hidden; the mask layer will add the specific ID of the hidden component.",
  "画布: dialog 组件支持 grid": "Canvas: the dialog component supports grid.",
  "画布: element table组件支持数据源配置": "Canvas: Element table component supports data source configuration.",
  "画布: element组件问题修复(radio组件默认值不生效问题、提供table组件height属性和maxheight属性默认值)": "Canvas: Element component problem fix (the default value of the radio component does not take effect, and the default value of the height attribute and maxheight attribute of the table component is provided).",
  "画布: form表单容器表单项配置交互优化、支持配置表单校验、函数编辑时支持指令获取form相关变量": "Canvas: form container form item configuration interaction optimization, support configuration form validation, support command to obtain form related variables when editing functions.",
  "画布: grid 支持背景色设置": "Canvas: rid supports background color setting.",
  "画布: h5容器背景图默认设置为100 %": "Canvas: H5 container background image is set to 100% by default.",
  "画布: html类型的slot支持编写vue语法": "Canvas: HTML type slot supports writing vue syntax.",
  "画布: mockData数据支持分页": "Canvas: mockData supports pagination.",
  "画布: table 自定义列内容": "Canvas: table custom column content.",
  "画布: v-for 指令的支持使用数据源": "Canvas: support for v-for directive using data source.",
  "画布: 丰富组件样式面板，组件支持配置更多样式属性": "Canvas: rich component style panel, component supports configuration of more style attributes.",
  "画布: 交互式组件优化": "Canvas: interactive Component Optimization.",
  "画布: 人员选择器增加v - model指令": "Canvas: added v-model directive to people selector.",
  "画布: 代码查看器及页面配置样式优化": "Canvas: code viewer and page configuration style optimization.",
  "画布: 代码查看器滚动条颜色与工具栏按钮大小调整": "Canvas: code viewer scrollbar color and toolbar button resizing.",
  "画布: 优化 grid、card 组件 hover 和 select 效果": "Canvas: optimize hover and select effects of grid and card components.",
  "画布: 优化单个页面报错，导致其它页面也预览失败问题": "Canvas: optimize the error reporting of a single page, causing other pages to also fail to preview.",
  "画布: 优化拖入交互底色过浅的问题、右键菜单交互问题": "Canvas: optimized the problem that the background color of the drag-in interaction is too light, and the right-click menu interaction problem.",
  "画布: 优化画布体验问题": "Canvas: optimize canvas experience issues.",
  "画布: 优化编辑器属性提示": "Canvas: optimize editor property hints.",
  "画布: 优化表格pagination配置": "Canvas: optimize table pagination configuration.",
  "画布: 优化计算变量和v - model填值情况": "Canvas: optimize calculation variables and v-model filling conditions.",
  "画布: 体验 bug 修复以及优化": "Canvas: experience bug fixes and optimizations.",
  "画布: 修复 divider 分割线组件外边距不生效的问题": "Canvas: fix the problem that the outer margin of the divider component does not take effect.",
  "画布: 修复 grid 外边距设置为负值时，失去焦点后，在右侧属性面板会自动变为 0 的问题": "Canvas: fix the problem that when the grid margin is set to a negative value, the property panel on the right will automatically change to 0 after losing focus.",
  "画布: 修复 input value 指令不为空的问题": "Canvas: fix the problem that the input value command is not empty.",
  "画布: 修复 tree 组件查看源码的错误和数据问题": "Canvas: fix the error and data problem of viewing the source code of the tree component.",
  "画布: 修复divider组件设置为纵向时高度不能设置问题": "Canvas: fix the problem that the height cannot be set when the divider component is set to portrait.",
  "画布: 修复element组件库pagination组件layout属性bug": "Canvas: fix the layout property bug of the pagination component in the Element component library.",
  "画布: 修复element组件库的radio组件默认值显示有误问题": "Canvas: fix the problem that the default value of the radio component in the Element component library is incorrectly displayed.",
  "画布: 修复p标签与文字相关组件的对齐问题": "Canvas: fix the alignment of p tags and text-related components.",
  "画布: 修复windows下快捷键不生效问题": "Canvas: fix the problem that shortcut keys do not work under windows.",
  "画布: 修复“源码查看  是否包含导航代码按钮”且换失效问题": "Canvas: fix the problem of \"Check source code contains navigation code button\" and replace it invalid.",
  "画布: 修复交互式组件出现嵌套渲染的问题": "Canvas: fix the problem of nested rendering of interactive components.",
  "画布: 修复交互式组件的若干问题": "Canvas: fixed several issues with interactive components.",
  "画布: 修复侧边栏收起后，快捷键失效，不能删除的问题": "Canvas: after the sideSlider is collapsed, the shortcut key fails and cannot be deleted.",
  "画布: 修复单选框和复选框组件预览时默认选中的选项无法去掉问题": "Canvas: fix the problem that the default selected option cannot be removed when the radio button and check box components are previewed.",
  "画布: 修复右侧属性面板中对象类型数据修改失败的问题": "Canvas: fixed the problem that the object type data modification failed in the property panel on the right.",
  "画布: 修复右键菜单无法触发的问题": "Canvas: fixed the problem that the right-click menu could not be triggered.",
  "画布: 修复各个组件中 text slot 的 XSS 问题": "Canvas: fix XSS issue of text slot in each component.",
  "画布: 修复复制组件没有复制slot问题": "Canvas: fix the problem that the copy component does not copy the slot.",
  "画布: 修复存为模板时，组件id被替换导致预览模板报错问题": "Canvas: when saving as a template, the component ID is replaced, causing an error in the preview template.",
  "画布: 修复对象类型变量，直接.引用变量会报错的问题": "Canvas: fix the problem that object type variables will report errors when directly referencing variables.",
  "画布: 修复导航首次预览无法获取最新数据问题": "Canvas: fixed the problem that the first preview of the navigation could not get the latest data.",
  "画布: 修复属性面板样式体验问题": "Canvas: fix property panel style experience issues.",
  "画布: 修复段落组件 p 标签下载下来与内容不同的问题": "Canvas: fix the problem that the downloaded p tag of the paragraph component is different from the content.",
  "画布: 修复添加模板到应用时，变量函数未成功添加的问题": "Canvas: fixed the problem that the variable function was not successfully added when adding a template to the APP.",
  "画布: 修复画布锁相关问题": "Canvas: fix canvas lock related issues.",
  "画布: 修复组件和grid设置margin时画布渲染异常问题": "Canvas: fix the problem of abnormal canvas rendering when the component and grid set margin.",
  "画布: 修复编辑form - item导致表单组件内容被重置问题": "Canvas: fix the problem that editing form - item causes the content of the form component to be reset.",
  "画布: 修复自定义组件信息展示与无法收藏问题": "Canvas: fix the problem of custom component information display and failure to collect.",
  "画布: 修复自由布局中表格宽度不断增大的问题": "Canvas: fix the problem that the width of the table in the free layout keeps increasing.",
  "画布: 修复自由布局偶现无法选中问题，自由布局高度减小使组件溢出问题": "Canvas: fix the problem that the free layout cannot be selected occasionally, and the height of the free layout is reduced so that the component overflows the problem.",
  "画布: 修复自由布局高度调整后，计算可拖拽区域没有实时更新的问题": "Canvas: fixed the problem that the calculated draggable area was not updated in real time after the free layout height was adjusted.",
  "画布: 修复表格列选中排序后，再次点击表格时，排序多选框没有回填回来的问题": "Canvas: fix the problem that the sorting multi-selection box is not backfilled when clicking the table again after sorting is selected in the table column.",
  "画布: 修复表格自定义列绑定函数使用报错问题": "Canvas: fix the problem of error reporting when using table custom column binding function.",
  "画布: 修复表格自定义列绑定的函数，存为模板时未带上绑定函数的问题": "Canvas: fixed the problem that the binding function of the custom column of the table was not included when saving it as a template.",
  "画布: 修复边框设置圆角不生效问题": "Canvas: fix the problem that the rounded corners of the border setting do not take effect.",
  "画布: 修复部分组件复制时报错问题": "Canvas: fixed an error reported when copying some components.",
  "画布: 修复部署后页面padding设置为0不生效问题": "Canvas: fix the problem that the page padding setting to 0 does not take effect after deployment.",
  "画布: 修复页面样式设置影响其它页面的问题": "Canvas: fixed page style setting affecting other pages.",
  "画布: 修复页面组件树删除搜索内容触发删除组件问题": "Canvas: fix page component tree delete search content triggers delete component issue.",
  "画布: 修复预览页面与部署后页面样式不一致的问题": "Canvas: fixed the issue that the style of the preview page was inconsistent with that of the deployed page.",
  "画布: 修改number输入框可输入非法数字的问题": "Canvas: modify the number input box to enter illegal numbers",
  "画布: 修改部署页面title": "Canvas: modify the title of the deployment page.",
  "画布: 函数交互优化，事件配置面板更新，选择函数时提供对应函数示例": "Canvas: optimize function interaction, update event configuration panel, provide corresponding function examples when selecting a function.",
  "画布: 函数执行参数支持使用变量": "Canvas: function execution parameters support the use of variables.",
  "画布: 函数配置优化，配置执行参数时展示对应的参数名": "Canvas: function configuration optimization, display the corresponding parameter name when configuring execution parameters.",
  "画布: 卡片列表案例保存模板后预览报错": "Canvas: the card list case previews an error after saving the template.",
  "画布: 右侧属性面板加上组件文档链接地址": "Canvas: the property panel on the right plus the link address of the component document.",
  "画布: 图表高度设置问题": "Canvas: chart height setting problem.",
  "画布: 基础组件增加 bkflow 流程组件": "Canvas: basic components add BKflow components.",
  "画布: 基础组件新增 Element 组件库以及 vue - weui 组件库": "Canvas: added Element component library and vue-weui component library for basic components.",
  "画布: 增加画布中交互式组件的检测和使用提示": "Canvas: add detection and usage hints for interactive components in the canvas.",
  "画布: 增加页面级别的样式配置, 可在画布编辑页页面设置tab设置页面内容区域的样式": "Canvas: add page-level style configuration, you can set the style of the page content area in the page setting tab of the canvas edit page.",
  "画布: 复制 slot 可拖拽类型组件时预览和生成源码报错问题": "Canvas: preview and generate source code error when copying slot draggable type components.",
  "画布: 存为模板时，支持更新覆盖已有模板，并支持编辑模板时上传模板封面": "Canvas: when saving as a template, it supports updating and overwriting the existing template, and supports uploading the template cover when editing the template.",
  "画布: 导航布局支持设置主题色": "Canvas: navigation layout supports setting theme color.",
  "画布: 导航模板侧边导航默认展开；右上角显示用户名以及支持退出登录功能": "Canvas: the side navigation of the navigation template is expanded by default; the upper right corner displays the user name and supports the logout function.",
  "画布: 导航组件支持分别设置背景色和主题色": "Canvas: the navigation component supports setting the background color and theme color separately.",
  "画布: 导航设置优化，新增页面时可选将页面添加到导航菜单中": "Canvas: optimized navigation settings, you can choose to add pages to the navigation menu when adding new pages.",
  "画布: 属性、指令支持设置变量": "Canvas: attributes and commands support setting variables.",
  "画布: 属性切换为变量方式时的增加数据示例": "Canvas: example of adding data when the property is switched to variable mode.",
  "画布: 属性面板优化，值为数组类型的属性，支持配置远程函数": "Canvas: optimized the property panel, the value is an array type property, and supports configuring remote functions.",
  "画布: 属性面板多类型属性值切换类型 tab 时，保留编辑的值": "Canvas: when switching type tabs for multi-type attribute values ​​​​in the attribute panel, the edited value is retained.",
  "画布: 属性面板样式调整": "Canvas: property panel style adjustment.",
  "画布: 布局 UI 优化": "Canvas: layout UI optimization.",
  "画布: 布局增加行组件，行和列选中交互优化": "Canvas: add row components to the layout, and optimize the interaction between row and column selection.",
  "画布: 应用导航logo支持选择图片": "Canvas: APP navigation logo supports selecting images",
  "画布: 拖拽排序效果优化为：当鼠标放到拖拽 icon 上时触发拖拽效果": "Canvas: the effect of drag and drop sorting is optimized to: trigger the drag and drop effect when the mouse is placed on the drag icon.",
  "画布: 支持 json 导入和渲染": "Canvas: supports JSON import and rendering.",
  "画布: 支持设置自定义样式，可自定义编写 CSS 代码": "Canvas: supports setting custom styles, and can customize CSS code.",
  "画布: 支持远程函数或数据源的属性，支持自定义变量": "Canvas: supports properties of remote functions or data sources, supports custom variables.",
  "画布: 整体画布重构、持续优化画布拖拽体验，fix画布与预览不一致问题": "Canvas: overall canvas reconstruction, continuous optimization of the canvas drag experience, fix the inconsistency between the canvas and the preview.",
  "画布: 文字链接组件 icon 位置配置改成下拉选择": "Canvas: Change the icon position configuration of the text link component to a drop-down selection.",
  "画布: 文字链接组件增加 click 事件": "Canvas: add click event to text link component.",
  "画布: 文字链接组件支持新窗口打开": "Canvas: text link component supports new window opening.",
  "画布: 文字链接（link）组件支持设置padding、背景色和圆角样式": "Canvas: the text link (link) component supports setting padding, background color and rounded corner style.",
  "画布: 文本、段落、链接等文字类组件可在画布直接编辑文字": "Canvas: text components such as text, paragraphs, links, etc. can edit text directly on the canvas.",
  "画布: 新增 dialog 组件": "Canvas: add dialog component.",
  "画布: 新增 divider 分割线组件": "Canvas: add divider component.",
  "画布: 新增 sideslider 组件": "Canvas: added sideslider component.",
  "画布: 新增 v -if, v - show, v -for 指令": "Canvas: added v-if, v-show, v-for directives.",
  "画布: 新增[函数使用指引](/help/method)": "Canvas: added [Function Usage Guide](/help/method).",
  "画布: 新增[自由布局](/help/free - layout)": "Canvas: added [Free Layout](/help/free - layout).",
  "画布: 新增函数支持编辑函数标识": "Canvas: added function to support editing function code.",
  "画布: 新增函数调用参数": "Canvas: added function call parameters.",
  "画布: 新增图标面板，与基础组件、自定义组件面板区分开来，方便用户拖拽图标": "Canvas: add an icon panel to distinguish it from the basic components and custom component panels, making it easy for users to drag and drop icons.",
  "画布: 新增复合组件": "Canvas: new Composite Components.",
  "画布: 新增按钮组组件": "Canvas: add button group component.",
  "画布: 新增文本框基础组件": "Canvas: added basic component of text box.",
  "画布: 新增简易版tab组件，可在画布中直接拖拽每个tab下的内容": "Canvas: add a simple version of the tab component, which can directly drag and drop the content under each tab in the canvas.",
  "画布: 新增组件树": "Canvas: added component tree.",
  "画布: 新增表格时表格的条纹、boreder 属性不生效问题": "Canvas: when adding a table, the stripes and boreder attributes of the table do not take effect.",
  "画布: 新增页面 json 展示": "Canvas: add page JSON display.",
  "画布: 步骤组件 steps 支持页面配置": "Canvas: step component steps supports page configuration.",
  "画布: 段落组件支持 v - model": "Canvas: paragraph component supports v-model.",
  "画布: 段落组件自动换行优化": "Canvas: paragraph component word wrap optimization.",
  "画布: 添加段落组件": "Canvas: add paragraph component.",
  "画布: 源码查看和json查看使用monaco - editor": "Canvas: source code viewing and JSON viewing using Monaco-Editor.",
  "画布: 用到获取远程数据的地方提供数据示例": "Canvas: provides examples of data used to fetch remote data.",
  "画布: 画布交互体验优化": "Canvas: canvas interactive experience optimization.",
  "画布: 画布体验问题优化": "Canvas: canvas experience optimization.",
  "画布: 画布体验问题修复": "Canvas: canvas experience bug fixes.",
  "画布: 画布增加调整组件宽高、边距位置，组件居中的便捷操作": "Canvas: canvas adds convenient operations for adjusting component width, height, margin position, and component centering.",
  "画布: 画布增加选中和操作列": "Canvas: canvas adds selection and operation columns.",
  "画布: 画布拖拽体验问题优化": "Canvas: canvas drag and drop experience optimization.",
  "画布: 画布支持实时预览，更新画布和函数变量等不需要重新刷新页面或新开窗口": "Canvas: canvas supports real-time preview, updating the canvas and function variables does not require refreshing the page or opening a new window.",
  "画布: 画布空白区域支持鼠标右键面板操作": "Canvas: the blank area of ​​the canvas supports panel operation with the right mouse button.",
  "画布: 画布编辑页面增加加锁和抢占功能": "Canvas: canvas editing page adds lock and preemption functions.",
  "画布: 画布编辑页面增加新手指引": "Canvas: a novice guide has been added to the canvas editing page.",
  "画布: 画布页面下拉框取消页面跳转后选中态错误": "Canvas: canvas page drop-down box cancels the selected state error after page jump.",
  "画布: 移动端h5容器相关体验问题优化": "Canvas: optimization of mobile h5 container-related experience issues.",
  "画布: 移动端input增加宽度设置": "Canvas: increase the width setting of the input on the mobile terminal.",
  "画布: 移动端增加tab组件": "Canvas: add tab component on mobile terminal.",
  "画布: 移动端拖拽时、自适应单位": "Canvas: when dragging on the mobile side, adaptive units.",
  "画布: 移动端画布增加h5容器，可用于拖拽生成宣传活动类h5页面": "Canvas: the mobile canvas adds an H5 container, which can be used to drag and drop to generate H5 pages for promotional activities.",
  "画布: 移动端画布，顶部编辑组件，tooltips被遮挡": "Canvas: mobile canvas, top editing components, tooltips are blocked.",
  "画布: 移动端组件在自由布局中渲染异常问题": "Canvas: abnormal rendering of mobile components in free layout.",
  "画布: 移动端组件属性优化": "Canvas: optimization of mobile component properties.",
  "画布: 移动端组件放开动画设置，增加多行布局": "Canvas: Mobile component releases animation settings and adds multi-line layout.",
  "画布: 移动端页面增加模拟header区域": "Canvas: add a simulated header area to the mobile page.",
  "画布: 移动端页面新增底部导航布局": "Canvas: added bottom navigation layout for mobile pages.",
  "画布: 组件 slot支持拖拽（card 组件）": "Canvas: component slot supports drag and drop (card component).",
  "画布: 组件属性文案统一优化": "Canvas: unified optimization of component property copywriting.",
  "画布: 组件属性设置中，优化 Array 类型数据的编辑模式，采用 jsonView 的形式": "Canvas: in the component property setting, optimize the editing mode of Array type data in the form of JSONView.",
  "画布: 组件支持设置v - bkloading和v - bk - tooltips指令": "Canvas: component supports setting v-bkloading and v-bk-tooltips directives.",
  "画布: 组件数据类型选择远程函数时，支持配置函数返回的key和value": "Canvas: when the component data type selects a remote function, it supports configuring the key and value returned by the function.",
  "画布: 组件级别开放存为模板按钮": "Canvas: component level open save as template button.",
  "画布: 编辑页面体验问题": "Canvas: edit page experience issues.",
  "画布: 自定义组件 ID 中带有 `_数字` 时，生成源码 eslint 检测不通过的问题": "Canvas: when the custom component ID contains `_number`, the generated source code eslint detection fails.",
  "画布: 自定义组件新增收藏功能": "Canvas: custom component added collection function.",
  "画布: 自由布局容器自适应高度问题": "Canvas: free layout container adaptive height problem.",
  "画布: 自由布局拖入组件位置调整、拖拽体验优化": "Canvas: free layout drag-in component position adjustment, drag-and-drop experience optimization.",
  "画布: 表单容器支持配置操作按钮显示或隐藏": "Canvas: form container supports configuring action buttons to show or hide.",
  "画布: 表单容器结合数据源，表单容器使用优化": "Canvas: the form container is combined with the data source, and the use of the form container is optimized.",
  "画布: 表单容器表单项编辑增加保存并继续新增选项": "Canvas: form container form item editing adds save and continue to add options.",
  "画布: 表单画布头部操作按钮顺序和自定义画布保持一致": "Canvas: the order of the action buttons on the header of the form canvas is consistent with that of the custom canvas.",
  "画布: 表单类组件支持设置简约风格": "Canvas: form components support simple style.",
  "画布: 表格、导航、tab、step、select、radio、radioButton、面包屑的表头或内容选项，增加拖动排序能力": "Canvas: table, navigation, tab, step, select, radio, radioButton, breadcrumb header or content options, increase the ability to drag and sort.",
  "画布: 表格使用优化：表格分页配置优化，表格数据支持全局排序和全局过滤": "Canvas: table usage optimization: table paging configuration optimization, table data supports global sorting and global filtering.",
  "画布: 表格列增加宽度设置": "Canvas: table column increase width setting.",
  "画布: 表格增加首列为多选框的配置": "Canvas: the table adds the configuration of the first column as a multi-selection box.",
  "画布: 表格添加 pagination, showPaginationInfo 配置，支持设置翻页": "Canvas: add pagination, showPaginationInfo configuration to the table, support setting page turning.",
  "画布: 表格的表头新增，prop 格式不统一问题": "Canvas: the header of the table is added, and the prop format is not uniform.",
  "画布: 表格类复合组件的表头刷新优化": "Canvas: table header refresh optimization for table composite components.",
  "画布: 表格组件分页配置，count 值与默认 data 条数保持一致": "Canvas: table component pagination configuration, the count value is consistent with the default number of data items.",
  "画布: 远程函数添加说明；小窗复制的函数（未保存状态下）不显示删除和复制的 icon；函数管理的说明文档双引号改为单引号": "Canvas: add instructions for remote functions; the function copied in the small window (unsaved state) does not display the deleted and copied icons; double quotes in the description document of function management are changed to single quotes.",
  "画布: 选中组件时增加复制粘贴操作操作": "Canvas: add copy and paste operation when component is selected.",
  "画布: 通过样式设置尺寸宽度为百分比时画布中组件宽度显示不正确的问题": "Canvas: when the size width is set as a percentage by style, the width of the component in the canvas is displayed incorrectly.",
  "画布: 重构slot相关逻辑，支持同时配置多个slot、具名slot等，方便后续更灵活配置各类组件的slot": "Canvas: refactor slot-related logic, support simultaneous configuration of multiple slots, named slots, etc., to facilitate subsequent and more flexible configuration of slots for various components.",
  "画布: 预览和保存分离，预览时不自动保存画布内容": "Canvas: preview and save are separated, and the canvas content is not automatically saved when previewing.",
  "画布中，组件新增指令配置，可用来配置组件的指令，在编辑函数时，可以通过编辑器自动补全、代码提示来获取组件的对应属性指令值": "In the canvas, the component adds command configuration, which can be used to configure the component's command. When editing a function, you can use the editor's auto-completion and code prompts to obtain the corresponding property command value of the component.",
  "画布仅剩一个 grid 时，不允许删除；": "When there is only one grid left in the canvas, deletion is not allowed.",
  "画布：组件样式补充（link、input、upload、timeline、diff、布局、colorpicker）": "Canvas: component style supplement (link, input, upload, timeline, diff, layout, colorpicker).",
  "组件新增 v - model 配置": "Components add v-model configuration.",
  "细节优化": "Optimization of details.",
  "细节样式优化": "Detail style optimization.",
  "自定义组件、应用部署、函数管理模块部分 bug 修复": "Some bug fixes for custom components, APP deployment, and function management modules.",
  "自定义组件文档体验优化、文档完善": "Customized component documentation experience optimization, complete documentation.",
  "说明": "Illustrate",
  "部署: 修复人名组件自动适配http / https问题": "Deployment: fix the problem that the name component automatically adapts to http/https.",
  "部署: 修复部署后表格未展示问题": "Deployment: fix the problem that the form is not displayed after deployment.",
  "部署: 已发布至应用市场的应用显示为未发布": "Deployment: APP that have been published to the APP market are shown as unpublished.",
  "部署: 部署日志交互优化": "Deployment: deployment log interaction optimization.",
  "部署: 部署页面始终展示“更多操作”": "Deployment: deployment page always shows \"More Actions\"",
  "部署模块新增下架功能、同步 Paas 平台部署记录": "Added archiving function to the deployment module and synchronized the deployment records of the PaaS.",
  "页面添加开源版入口": "Add an open source version entry to the page.",
  "预览 / 部署: 新增 BKPAAS_ENVIRONMENT 变量，自定义组件判断环境使用": "Preview/deployment:add BKPAAS_ENVIRONMENT variable, custom component to judge environment usage.",
  "预览 / 部署: 添加应用预览": "Preview/deploy: add APP preview.",
  "预览 / 部署: 部署页面增加绑定模块对应的 v3 进程管理页面入口": "Preview/deployment: the v3 process management page entry corresponding to the binding module is added to the deployment page.",
  "预览 / 部署: 部署页面样式错乱问题": "Preview/deployment: deployment page style disorder problem.",
  "预览: 修复删除页面后点击导航菜单页面空白问题": "Preview: fix the blank page problem when clicking the navigation menu after deleting the page.",
  "预览: 修复版本导致的预览内容不正确的问题": "Preview: fix the problem that the preview content caused by the version is incorrect.",
  "预览: 修复移动端模板预览未在手机背景中预览问题": "Preview: fix the problem that the template preview on the mobile terminal is not previewed in the background of the mobile phone.",
  "预览: 图标大小预览时不生效问题、exception组件预览时不居中问题": "Preview: fhe problem that the icon size does not take effect when previewing, and the problem that the exception component is not centered when previewing.",
  "流程 & 表单：流程管理页区分预览、i节点增加调用调试功能预发布、生产环境流程记录": "Flow & form: flow management page differentiated preview, i-node added call debugging function Staging, Production Env flow record.",
  "画布: 新增": "Canvas: new",
  "应用: 应用支持归档": "APP: APP supports archiving",
  "应用: 发布部署模块页面重构": "APP: refactor deployment module page",
  "移动端: 新增侧边导航": "Mobile: add side navigation",
  "画布: 页面内置边距回显到页面样式的padding属性": "Canvas: page built-in padding echoes to page style padding property",
  "画布: 组件属性面板支持搜索": "Canvas: component property panel supports search",
  "画布: 当页面模板中含有tab组件时，应用页面模板失败": "Canvas: APP page template fails when there are tab components in the page template",
  "应用: 国际化相关样式修复": "APP: fix internationalization-related styles",
  "应用: markdown类型页面以组件形式整合到自定义页面": "APP: Markdown type pages integrated into custom pages as components",
  "函数: 代码编辑器支持代码提示跟代码生成": "Function: Code editor supports code autocomplete and code generation",
  "数据源: 数据管理模块支持自然语言描述生成SQL": "Data source: Data management module supports generating SQL from natural language descriptions",
  "移动端: 新增宫格布局": "Mobile: Add grid layout",
  "移动端: 新增简易tab组件": "Mobile: Add simple tab component",
  "画布: transfer, cascade, process, big-tree等组件可配置对应的实际使用字段跟展示字段": "Canvas: Components like transfer, cascade, process, big-tree, etc. can be configured with corresponding actual usage fields and display fields",
  "画布: ai对话框增加常用提示模板": "Canvas: AI dialog box adds commonly used prompt templates",
  "画布: 支持事件行为跟自然语言描述生成事件": "Canvas: Support event behavior and generate events through natural language descriptions",
  "画布: 可切换类型的组件 value值设置及校验需要和类型一致": "Canvas: Value setting and validation of switchable components need to be consistent with the type",
  "应用: vue2应用表单类型页面以表单容器组件形式整合到自定义页面": "APP: Vue2 APP form type pages integrated into custom pages as form container components",
  "应用: vue2应用数据管理类型页面以数据管理容器组件形式整合到自定义页面": "APP: Vue2 APP data management type pages integrated into custom pages as data management container components",
  "画布: vue3应用支持表单容器跟数据管理容器组件": "Canvas: Vue3 APP supports form container and data management container components",
  "画布: AI小鲸支持页面需求描述 拆解任务 完成多个组件布局生成": "Canvas: AI Little Whale supports page requirement description, task breakdown, and completion of multiple component layouts",
  "发布部署: 新建的应用部署后为开发者中心云原生类型类用，发布部署模块适配云原生类型应用": "Release Deployment: After deployment, the newly created APP will be used in the Developer Center for cloud-native type APPs. The release deployment module is compatible with cloud-native type APPs",
  "画布: 修复echart图表无法自适应屏幕宽高变化问题": "Canvas: Fixed the issue of echart charts not adapting to changes in screen width and height",
  "移动端: 修复vant样式冲突问题": "Mobile: Fixed the issue of style conflicts with Vant",
  "应用: 应用内左侧导航调整": "APP: Adjust left side navigation within the APP",
  "应用: 对接消息通知中心": "APP: Integrate with Blueking message notification center",
  "应用: 发布部署数据同步到homepage": "APP: Deploy data synchronization to homepage”",
  "数据源: 支持接入第三方数据库": "Data Source: Support integration with third-party databases",
  "数据源: sql语句在api层面加密传输": "Data Source: Encrypt SQL statements for transmission at the API level”",
  "移动端: h5容器swipper组件升级": "Mobile: Upgrade H5 container swiper component",
  "画布: table支持设置状态列": "Canvas: Table supports setting status columns",
  "应用: 预览页跟画布编辑页自定义组件加载速度优化": "APP: Optimized loading speed of custom components in preview and canvas editing pages",
  "应用: ajax请求401时调整为弹出小窗登录": "APP: Adjusted to pop up a small window for login when receiving a 401 error in AJAX requests",
  "应用: 创建页面失败自动定位到错误位置": "APP: Automatically navigate to the error location when creating a page fails",
  "数据源: 兼容ENUM类型": "Data Source: Compatible with ENUM types",
  "API: object跟array类型参数可绑定变量": "API: Object and array type parameters can be bound to variables",
  "应用: 修复权限校验问题": "APP: Fixed permission verification issue",
  "应用: package.json部分依赖升级": "APP: Upgraded some dependencies in package.json",
  "画布: 修复vue3中table偶现无法删除": "Canvas: Fixed occasional inability to delete tables in Vue 3",
  "画布: 修复table组件无法渲染问题": "Canvas: Fixed issue with table component not rendering",
  "画布: 修复页面JSON内函数payload中format不存在的问题": "Canvas: Fixed issue with non-existent 'format' in function payload within page JSON",
  "画布: 修复表单容器内radio事件不生效问题": "Canvas: Fixed issue with radio events not working within form containers"
}